[
    {
        "meta": {
            "original_doc_id": "MRKWC00020250604el640018h",
            "language": {
                "code": "en"
            },
            "source": {
                "code": "mrkwc",
                "name": "MarketWatch"
            }
        },
        "links": {
            "self": "https://api.dowjones.com/content/drn:archive.newsarticle.MRKWC00020250604el640018h"
        },
        "attributes": {
            "snippet": {
                "content": [
                    {
                        "text": "U.S. trade wars turbocharged sales of new cars and trucks in the spring to a four-year high, but the mad dash by consumers to avoid tariff-related price increases ran out of gas in May."
                    }
                ]
            },
            "copyright": {
                "text": "Copyright 2025 MarketWatch, Inc.  All Rights Reserved."
            },
            "content_type": "Article",
            "load_time": "2025-06-04T16:19:08.955Z",
            "modification_date": "2025-06-04",
            "publication_date": "2025-06-04",
            "load_date": "2025-06-04",
            "byline": {
                "text": "By Jeffry Bartash"
            },
            "headline": {
                "main": {
                    "text": "Car buyers drove sales to a 4-year high to beat tariffs. Now sales are running out of gas. Trade wars cause U.S. economy to seesaw"
                }
            },
            "modification_time": "2025-06-04T16:18:48.000Z",
            "content": [
                {
                    "text": "Car buyers drove sales to a 4-year high to beat tariffs. Now sales are running out of gas. Trade wars cause U.S. economy to seesaw U.S. trade wars turbocharged sales of new cars and trucks in the spring to a four-year high, but the mad dash by consumers to avoid tariff-related price increases ran out of gas in May. Sales of new cars and trucks in the U.S. dropped almost 10% in May to a 15.6 million annual rate, according to automotive researcher Wards Intelligence. That's how many vehicles would be sold over the entire year if the same number that were bought in May were purchased in every month. The big ups and downs in car purchases this year illuminate the disruptions caused to the economy by the Trump administration's efforts to remake a global trading system that has been in place for decades. Economists predict the U.S. will suffer slower and more uneven growth — and potentially higher inflation — until the trade fights are resolved. The tariffs have also altered the timing of when individuals and companies make big purchases. The car business is a good example. Buyers piled into dealerships in March and April to buy new cars and trucks before the Trump administration's auto and steel tariffs raised prices. Sales raced to as high as a 17.8 million annual rate in March from less than 16 million in the first two months of 2025. The last time sales were that strong was early 2021, as the U.S. emerged from the pandemic. Now comes the flip side of the coin: dwindling sales. Dealers have begun running out of vehicles they obtained before the tariffs kicked in, while the rising costs of imported goods and domestic steel have pushed some carmakers to raise prices. Ryan Sweet, chief economist at Oxford Economics, said auto sales in March are likely to be the high point of the year. He predicts sales will continue to slow before rebounding next year. Higher prices and a lack of vehicles for sale — especially less expensive cars — hampered sales in May. The Trump administration has relaxed some tariffs on vehicles, but it just doubled them on steel and aluminum. Metals tariffs could complicate the efforts of carmakers to build and sell more vehicles. Car purchases play a big role in retail sales and in overall consumer spending, the main engine of the economy. Rising car sales tend to be an indicator of a strong economy. A potential slowdown in sales tied to the tariffs wouldn't be enough to send the U.S. economy into a tailspin, economists say, but automobile-industry leaders warn of tougher times ahead. Ford F, for instance, suspended its regular forecast of future sales and profits because of uncertainty sparked by the trade wars."
                }
            ],
            "publication_time": "2025-06-04T16:13:00.000Z"
        },
        "id": "drn:archive.newsarticle.MRKWC00020250604el640018h",
        "type": "content"
    },
    {
        "meta": {
            "original_doc_id": "DJDN000020250603el63002rw",
            "language": {
                "code": "en"
            },
            "source": {
                "code": "djdn",
                "name": "Dow Jones Newswires"
            }
        },
        "links": {
            "self": "https://api.dowjones.com/content/drn:archive.newsarticle.DJDN000020250603el63002rw"
        },
        "attributes": {
            "snippet": {
                "content": [
                    {
                        "text": "Americans are still buying a lot of cars, despite broader consumer concerns about the economy and rising prices as a result of tariffs."
                    },
                    {
                        "text": "Carmakers sold 1.2 million vehicles in May, roughly in line with the figure from last year, according to ..."
                    }
                ]
            },
            "copyright": {
                "text": "Copyright © 2025, Dow Jones & Company, Inc."
            },
            "content_type": "Article",
            "load_time": "2025-06-03T21:14:15.393Z",
            "modification_date": "2025-06-03",
            "publication_date": "2025-06-03",
            "load_date": "2025-06-03",
            "byline": {
                "text": "By Christopher Otts"
            },
            "headline": {
                "main": {
                    "text": "Americans Still Hit the Car Lots in May -- WSJ"
                }
            },
            "modification_time": "2025-06-03T21:13:41.000Z",
            "content": [
                {
                    "text": "Americans Still Hit the Car Lots in May -- WSJ Americans are still buying a lot of cars, despite broader consumer concerns about the economy and rising prices as a result of tariffs. Carmakers sold 1.2 million vehicles in May, roughly in line with the figure from last year, according to an estimate from research firm J.D. Power. Sales returned to a more typical pace in the month following a rush of buying in late March and April, which analysts attributed to consumers seeking to get ahead of President Trump's threatened tariffs on automotive imports. Concerns about inflation and the impact higher tariffs could have on prices have weighed on consumer confidence, which remains near a record low. Low consumer confidence can indicate that Americans are less willing to spend on big ticket purchases, like automobiles. Thus far that gloomy mood has yet to spread onto dealer lots. Americans spent around $53.8 billion on new vehicles in May, a 7% increase from a year prior, according to J.D. Power. General Motors, which has not yet reported sales results for May, has said it expects industry prices to hold steady in 2025. People paid $45,462 on average for a new vehicle in May, according to J.D. Power. Ford reported a 16% increase in May compared with a year earlier, bolstered by an \"employee pricing\" discount program. Toyota said May sales grew 11%, as a result of a sharp increase in hybrid and sedan sales. The Japanese carmaker imports around 45% of the vehicles it sells in the U.S. from factories outside the country and has said U.S. tariffs added $1.25 billion to its costs in April and May. Honda reported a 7% gain in sales, despite a sharp increase in imported car sales. Korean automakers Hyundai and Kia said sales rose 8% and 5%, respectively. Mazda, a Japanese brand that relies heavily on imports, saw its sales plunge 19%. This item is part of a Wall Street Journal live coverage event. The full stream can be found by searching P/WSJL (WSJ Live Coverage). (END) Dow Jones Newswires June 03, 2025 15:52 ET (19:52 GMT)"
                }
            ],
            "publication_time": "2025-06-03T19:52:03.957Z"
        },
        "id": "drn:archive.newsarticle.DJDN000020250603el63002rw",
        "type": "content"
    },
    {
        "meta": {
            "original_doc_id": "RTCNWS0020250602el620008b",
            "language": {
                "code": "zhcn"
            },
            "source": {
                "code": "rtcnws",
                "name": "道琼斯中文通讯 (简体)"
            }
        },
        "links": {
            "self": "https://api.dowjones.com/content/drn:archive.newsarticle.RTCNWS0020250602el620008b"
        },
        "attributes": {
            "snippet": {
                "content": [
                    {
                        "text": "\n\n  周一在全球股市的下跌股当中，丰田汽车(Toyota)和Jeep制造商Stellantis赫然位列其中，两家车企的股价分别在东京和米兰下跌约3%。 "
                    }
                ]
            },
            "copyright": {
                "text": "Copyright © 2025, Dow Jones & Company, Inc."
            },
            "content_type": "Article",
            "load_time": "2025-06-02T09:31:06.121Z",
            "modification_date": "2025-06-02",
            "publication_date": "2025-06-02",
            "load_date": "2025-06-02",
            "headline": {
                "main": {
                    "text": "特朗普计划上调钢铝关税的举动导致汽车股普遍走低"
                }
            },
            "modification_time": "2025-06-02T09:30:18.000Z",
            "content": [
                {
                    "text": "特朗普计划上调钢铝关税的举动导致汽车股普遍走低 周一在全球股市的下跌股当中，丰田汽车(Toyota)和Jeep制造商Stellantis赫然位列其中，两家车企的股价分别在东京和米兰下跌约3%。 美国总统特朗普(Trump)承诺从周三起将把钢铁和铝的关税税率提高一倍至50%，而此举将增加车企在美国的制造成本。投资者对这个消息做出反应。 福特汽车(Ford, F)和通用汽车(General Motors, GM)的股价在盘前的清淡交投中小幅下跌。 钢铁和铝在一辆汽车的重量中占很大一部分，在汽车成本中也占很大份额。据券商Bernstein称，将现有的25%钢铝关税提高一倍，将使特朗普关税造成的累计成本增加约5%，达到每辆车略高于7,000美元的水平。 By Stephen Wilmot 版权所有(c)2025道琼斯公司。本文版权归道琼斯公司所有，未经许可不得翻译或转载。 (END) Dow Jones Newswires 02-06-25 0930GMT"
                }
            ],
            "publication_time": "2025-06-02T09:30:13.735Z"
        },
        "id": "drn:archive.newsarticle.RTCNWS0020250602el620008b",
        "type": "content"
    },
    {
        "meta": {
            "original_doc_id": "PRTRIN0020250603el6300c1g",
            "language": {
                "code": "en"
            },
            "source": {
                "code": "prtrin",
                "name": "Press Trust of India"
            }
        },
        "links": {
            "self": "https://api.dowjones.com/content/drn:archive.newsarticle.PRTRIN0020250603el6300c1g"
        },
        "attributes": {
            "snippet": {
                "content": [
                    {
                        "text": "New Delhi, Jun 3 (PTI) India on Tuesday sought consultations with the US under the World Trade Organisation's (WTO) safeguard agreement over American tariffs on auto components."
                    }
                ]
            },
            "copyright": {
                "text": "Copyright 2025. The Press Trust of India Limited."
            },
            "content_type": "Article",
            "load_time": "2025-06-03T11:29:20.710Z",
            "modification_date": "2025-06-03",
            "publication_date": "2025-06-03",
            "load_date": "2025-06-03",
            "headline": {
                "main": {
                    "text": "India seeks WTO consultations with US over safeguard measures on auto components"
                }
            },
            "modification_time": "2025-06-03T11:28:21.000Z",
            "content": [
                {
                    "text": "India seeks WTO consultations with US over safeguard measures on auto components New Delhi, Jun 3 (PTI) India on Tuesday sought consultations with the US under the World Trade Organisation's (WTO) safeguard agreement over American tariffs on auto components. This move comes shortly after India reserved the right to impose retaliatory duties on select US products in response to American tariffs on steel and aluminium. On March 26, 2025, the US adopted a measure in the form of a tariff increase of 25 per cent ad valorem on imports of passenger vehicles and light trucks, and on certain automobile parts originating in or from India, a communication sent by India to WTO said. The measure on automobile parts applies from May 3, 2025 and for an unlimited duration. \"India considers that the measure, in its design and effect, constitutes a safeguard measure within the meaning of.... GATT (General Agreement on Trade and Tariff) 1994 and the Agreement on Safeguards, as it is intended to protect the US domestic industry from increased imports,\" it said. It added that the United States failed to notify the WTO Committee on safeguards under a provision of the Agreement on Safeguards (AoS) on taking a decision to apply the safeguard measure. \"Accordingly, as an affected Member with significant export interest to the United States in the products concerned, India requests consultations with the United States,\" it said. In the consultations, India would like to exchange views on the measure. \"India looks forward to receiving a prompt reply to this request from the United States and to setting a mutually convenient date and venue for the... consultations,\" it said. India reserves all its rights under the agreement establishing the WTO. The US imported USD 89 billion worth of auto parts globally last year, with Mexico accounting for USD 36 billion, China for USD 10.1 billion, and India for just USD 2.2 billion."
                }
            ]
        },
        "id": "drn:archive.newsarticle.PRTRIN0020250603el6300c1g",
        "type": "content"
    },
    {
        "meta": {
            "original_doc_id": "PRESSA0020250603el63006mx",
            "language": {
                "code": "en"
            },
            "source": {
                "code": "pressa",
                "name": "Press Association National Newswire"
            }
        },
        "links": {
            "self": "https://api.dowjones.com/content/drn:archive.newsarticle.PRESSA0020250603el63006mx"
        },
        "attributes": {
            "snippet": {
                "content": [
                    {
                        "text": "The recent trade agreement with the US \"is the very best deal that the UK could have hoped for under the circumstances,\" a Jaguar Land Rover director has told MPs."
                    }
                ]
            },
            "copyright": {
                "text": "(c)2025, The Press Association, All Rights Reserved"
            },
            "content_type": "Article",
            "load_time": "2025-06-03T15:52:37.938Z",
            "modification_date": "2025-06-03",
            "publication_date": "2025-06-03",
            "load_date": "2025-06-03",
            "headline": {
                "main": {
                    "text": "The recent trade agreement with the US \"is the very best deal that the UK could..."
                }
            },
            "modification_time": "2025-06-03T15:52:14.000Z",
            "content": [
                {
                    "text": "The recent trade agreement with the US \"is the very best deal that the UK could... The recent trade agreement with the US \"is the very best deal that the UK could have hoped for under the circumstances,\" a Jaguar Land Rover director has told MPs. Appearing before the Commons Business and Trade Committee, Murray Paul said: \"We have seen a complete change in the landscape internationally, and I think where the UK has found itself in the relationship that is established with the administration, from an automotive perspective, is the best we could possibly hope for.\" Car manufacturers would \"of course\" like the 100,000 quota for a 10% tariff on car imports into the US to be higher, an industry figure has said. Murray Paul, public affairs director at Jaguar Land Rover told the Business and Trade committee: \"Of course we'd prefer for it to be higher. \"But I think if we're honest it's there or thereabouts what the current market volume is of producing from the UK into the US. \"We are expectant that it's administered fairly, that if there's a small amount of pain that that is distributed equally amongst British manufacturers of goods. \"Obviously we would like it to grow in the future because we think there's a growth opportunity in the US market as the incredible cars that we produce in this country are admired around the world. \"But I think for now, it works\". Asked how it could be calculated which manufacturers car tipped over the 100,000 quota if the figure is reached, Mr Paul told the committee that has \"yet to be determined\". He added: \"Whilst it hasn't been decided yet, most car manufacturers are advocating taking the 2024 sales volume into the US, percentagising that and then applying that to the 100% and distributing it back out to the manufacturers, so that you have an allocation essentially that you're going to work within.\" A Tata Steel director has told MPs that the EU is moving faster to defend the industry in response to US tariffs than the UK, with a cost to the industry of up to £150 million a year. Russell Codling, director of markets, business development and commercial services, said his company is \"extremely exposed\" to divergence in prices since the US imposed new tariffs. He said: \"We can see where our prices in the UK have followed similarly those in the EU for many, many years. At the moment, we're seeing them diverge, and the divergence is leading to currently something in the order of about 100 to 150 million revenue a year loss in the UK, in comparison with Europe. \"So it is not just for us making sure that this deal (with the US) is the right deal, it is also about making sure that the trade protection measures are the appropriate ones in the UK, and they are at least as good as other trading partners around the world. When asked if the UK needs to go faster on the issue, Mr Codling said: \"Absolutely.\" It is \"very hard to know what the US policy\" within biosciences and pharmaceuticals is, an industry figure has suggested. Steve Bates, chief executive of BioIndustry Association, was asked by the business and trade committee what he was hoping to get out of the recent deal with the US for the UK life-sciences sector. He said: \"We were hoping to ensure that the most valuable export market for UK pharmaceuticals was protected, that we'd be able to grow that more quickly, that they'd continue to be a valuable partner in innovation and science. \"I think the challenge that we've had at this stage is that it's very hard to know what the US policy in our sector is, since they haven't actually defined what they want to do yet. \"It's very difficult to buy a pig in a poke, but that's where we're at.\" A leading businessman in the bioethanol sector has told MPs the sector was \"shocked and really upset\" by the terms of the UK's trade agreement with the US, adding the industry will be destroyed without a Government rescue plan."
                }
            ],
            "publication_time": "2025-06-03T15:51:43.010Z"
        },
        "id": "drn:archive.newsarticle.PRESSA0020250603el63006mx",
        "type": "content"
    },
    {
        "meta": {
            "original_doc_id": "BSNLNO0020250603el630010g",
            "language": {
                "code": "en"
            },
            "source": {
                "code": "bsnlno",
                "name": "BusinessLine Online"
            }
        },
        "links": {
            "self": "https://api.dowjones.com/content/drn:archive.newsarticle.BSNLNO0020250603el630010g"
        },
        "attributes": {
            "snippet": {
                "content": [
                    {
                        "text": "India has sought consultations with the US at the World Trade Organisation (WTO) on tariff increase of 25 per cent on imports of passenger vehicles (PVs) and light trucks, and on certain automobile parts, stating that these were safeguard ..."
                    }
                ]
            },
            "copyright": {
                "text": "© 2025 THG Publishing Pvt. Ltd."
            },
            "content_type": "Article",
            "load_time": "2025-06-03T14:39:55.481Z",
            "modification_date": "2025-06-03",
            "publication_date": "2025-06-03",
            "load_date": "2025-06-03",
            "byline": {
                "text": "Amiti Sen"
            },
            "headline": {
                "main": {
                    "text": "India seeks consultations with US at WTO on auto tariffs"
                }
            },
            "modification_time": "2025-06-03T14:39:24.000Z",
            "content": [
                {
                    "text": "India seeks consultations with US at WTO on auto tariffs India has sought consultations with the US at the World Trade Organisation (WTO) on tariff increase of 25 per cent on imports of passenger vehicles (PVs) and light trucks, and on certain automobile parts, stating that these were safeguard measures that should have been notified by the US to the multilateral trade body. This comes on the heels of India reserving its rights at the WTO to retaliate against US tariffs on steel and aluminium. India may raise the issue of tariffs on both steel and aluminium and automobiles, seeking a rollback, in the ongoing bilateral trade agreement (BTA) negotiations with the US, sources said. Discuss compensation In its latest submission at the WTO, India pointed out that on March 26, 2025, the US adopted a measure in the form of a tariff increase of 25 per cent ad valorem on imports of PVs and light trucks, and on certain automobile parts originating in India. The measure on automobile parts applies from May 3 2025 and for an unlimited duration. \"India considers that the measure, in its design and effect, constitutes safeguard measure within the meaning of Article XIX of GATT 1994 and the Agreement on Safeguards (AoS), as it is intended to protect the US domestic industry from increased imports,\" it said. While India's export of cars and trucks to the US is low, that of its auto components to the country is significant and is estimated at around $6.8 billion in FY24. The US failed to notify the WTO Committee on Safeguards under Article 12.1(c) of the AoS on taking a decision to apply the safeguard measure. \"As an affected member with significant export interest to the United States in the products concerned, India requests consultations with the country to exchange views on the measure and to meet the objectives set out in Article 8.1, AoS,\" India submitted. This means that India wants to discuss compensation as Article 8.1 outlines the obligation of a member to compensate a trading partner for the application of a safeguard measure. This compensation requirement applies when a safeguard measure is imposed and causes, or threatens to cause, significant damage to the trading partner's exports. Safeguard measures India had also sought consultations with the US when it applied 25 per cent import duties on steel and aluminium products on March 12, 2025. While the US argued that the sector-specific duties were applied on national security grounds, India maintained that these were essentially safeguard duties. When wrongfully applied, the affected WTO member can seek permission for retaliation. \"The safeguard measures would affect $7.6 billion imports into the United States of the relevant products originating in India, on which the duty collection would be $1.91 billion,\" India's WTO submission noted. New Delhi proposed to suspend concessions on US goods of equivalent amount of duty at a later time. \"Now that the US is set to double steel and aluminium tariffs to 50 per cent from 25 per cent, the duty collection on India's exports of the items would have increased proportionately. It has to be seen if India gives a fresh submission on right for suspended concessions of a higher amount,\" a source pointed out."
                }
            ]
        },
        "id": "drn:archive.newsarticle.BSNLNO0020250603el630010g",
        "type": "content"
    },
    {
        "meta": {
            "original_doc_id": "DJDN000020250602el62002gf",
            "language": {
                "code": "en"
            },
            "source": {
                "code": "djdn",
                "name": "Dow Jones Newswires"
            }
        },
        "links": {
            "self": "https://api.dowjones.com/content/drn:archive.newsarticle.DJDN000020250602el62002gf"
        },
        "attributes": {
            "snippet": {
                "content": [
                    {
                        "text": "Al Root"
                    },
                    {
                        "text": "Shares of Ford Motor and General Motors were weak early Monday. Trade-related comments by President Donald Trump are the likeliest reason for the declines."
                    }
                ]
            },
            "copyright": {
                "text": "Copyright © 2025, Dow Jones & Company, Inc."
            },
            "content_type": "Article",
            "load_time": "2025-06-02T15:34:27.204Z",
            "modification_date": "2025-06-02",
            "publication_date": "2025-06-02",
            "load_date": "2025-06-02",
            "headline": {
                "main": {
                    "text": "Ford, GM Stocks Are Slipping. Investors Want a Brake on Tariffs. -- Barrons.com"
                }
            },
            "modification_time": "2025-06-02T15:34:12.000Z",
            "content": [
                {
                    "text": "Ford, GM Stocks Are Slipping. Investors Want a Brake on Tariffs. -- Barrons.com Al Root Shares of Ford Motor and General Motors were weak early Monday. Trade-related comments by President Donald Trump are the likeliest reason for the declines. \"It used to bother me [that] they make a part in Canada, a part in Mexico, a part in Europe, send it all over the place, nobody knew what the hell was happening,\" said President Trump at a Friday afternoon news conference thanking Elon Musk for his work at the Department of Government Efficiency. \"If you build a car, make it in America.\" President Trump went on to add that while he's given the industry some time -- about a year -- to adjust its parts supply, he expects parts manufacturing to come back to the U.S. GM and Ford stocks were down 4.7% and 4.4%, respectively, in early trading Monday. Stellantis shares were down 3.4%, while the S&P 500 and Dow Jones Industrial Average were down 0.3% and down 0.5%, respectively. Trump's tariff policy has loomed over the sector for months. There is a 25% import tariff on car imports. Roughly half the cars sold in the U.S. are imported, mainly from Mexico, Canada, Japan, and South Korea. Manufacturers have started to raise prices to offset tariffs, after existing pre-tariff inventory was sold. The parts issue looks to be a longer term problem for the industry to deal with. Auto makers including Ford have pointed out the difficult of making all parts in the U.S. a variety of ways. For starters, it makes sense for lower value parts to be made in lower-wage regions, such a Mexico. And it isn't easy to staff plants to, essentially, stamp metal repetitively. What's more, the U.S. doesn't make some things such as LED displays any more. Low-cost parts, common in both Asia and Europe -- and North America for now -- help auto makers keep new-car prices affordable. The president's recent comments demonstrate again that investors will be worrying about cost and the impact of affordability on demand for a while yet. Coming into Monday trading, Ford and GM stocks were up about 2% and 3%, respectively since President Trump's April 2 \"Liberation Day\" tariff announcement; however, the shares were down 2% and 8%, respectively, since the Nov. 5 election. Shares seem stuck while investors wait for clarity. Investors are really hoping for a change in Trump's policies regarding tariffs on parts. Write to Al Root at allen.root@dowjones.com This content was created by Barron's, which is operated by Dow Jones & Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal. (END) Dow Jones Newswires June 02, 2025 11:33 ET (15:33 GMT)"
                }
            ],
            "publication_time": "2025-06-02T15:33:24.021Z"
        },
        "id": "drn:archive.newsarticle.DJDN000020250602el62002gf",
        "type": "content"
    },
    {
        "meta": {
            "original_doc_id": "NAFTA00020250602el620002z",
            "language": {
                "code": "en"
            },
            "source": {
                "code": "nafta",
                "name": "CE NAFTA 2.0-USMCA"
            }
        },
        "links": {
            "self": "https://api.dowjones.com/content/drn:archive.newsarticle.NAFTA00020250602el620002z"
        },
        "attributes": {
            "snippet": {
                "content": [
                    {
                        "text": "Faced with the uncertainty generated by President Donald Trump's trade policy, Mexican companies are opting to export under the Mexico-United States-Canada Agreement (T-MEC). But which are the sectors that most use this protection?"
                    }
                ]
            },
            "copyright": {
                "text": "Copyright © ContentEngineLLC"
            },
            "content_type": "Article",
            "load_time": "2025-06-02T19:43:26.153Z",
            "modification_date": "2025-06-02",
            "publication_date": "2025-06-02",
            "load_date": "2025-06-02",
            "byline": {
                "text": "Rodrigo Rosales"
            },
            "headline": {
                "main": {
                    "text": "Automotive industry, the largest exporter within T-MEC"
                }
            },
            "modification_time": "2025-06-02T19:42:43.000Z",
            "content": [
                {
                    "text": "Automotive industry, the largest exporter within T-MEC Faced with the uncertainty generated by President Donald Trump's trade policy, Mexican companies are opting to export under the Mexico-United States-Canada Agreement (T-MEC). But which are the sectors that most use this protection? According to the latest quarterly report from Banco de México, January-March 2025, during the past year, almost 100% of the trucks, 80% of the cars and more than half of the auto parts that Mexico exported to the United States used the T-MEC. So did 100% of some fruits and vegetables, dairy products and eggs. In contrast, goods such as telephones, cell phones, computers and medical instruments were exported without using the treaty. The U.S. administration that took office in January of this year has made a substantial change in the direction of U.S. trade policy. In particular, it has imposed tariffs of significant magnitude on all its trading partners, explains Banxico. However, trade under the T-MEC has continued to receive preferential treatment, as most of the products traded under the agreement have remained tariff-free, although some steel and aluminum products face tariffs of 25%, and cars 15%. T-MEC rules of origin The Mexican central bank's quarterly report details that exporting under the T-MEC allows tariff-free access to the U.S. market. In order to export under this benefit, companies must comply with the rules of origin stipulated in the treaty. The rules of origin require that under the transaction value approach, more than 50% of the content must come from T-MEC member countries or that under the net cost approach, such percentage must be at least 60%. In the case of automobiles, the percentage of regional content increases to 75%. Until February 2025, according to Banxico, goods imported by the United States outside of a trade agreement faced Most Favored Nation (MFN) tariffs, which were relatively low in general, and in several cases close to or equal to zero. For example, Mexico's non-treaty exports of automotive goods to the United States in 2024 faced an average effective tariff of 1.4%. For non-automotive products the average effective tariff was only 0.2%, reads the central institution's report. In the absence of the T-MEC, it is estimated that the average tariff for total Mexican exports in 2024 would have been 3.2%, being on average higher for automotive exports (8.1%) than for non-automotive (3.4%). Photo art: Andrea Velázquez Estimates without T-MEC In the absence of the T-MEC, the average tariff for total Mexican exports in 2024 would be 3.2%; higher on average for automotive exports (8.1%) than for non-automotive exports (3.4%). In general, sectors that have faced relatively high MFN tariffs for the export of their products to the United States have tended to make more intensive use of the treaty. Banxico cites the example of trucks, which face a 25% MFN tariff, which has encouraged the creation of regional supply chains that have allowed almost all of these goods to be exported under the agreement. Cars and auto parts, on the other hand, face relatively low average MFN tariffs of 2.5% and 1.3%, respectively, so the cost of not complying with the rules of origin is lower. Thus, in 2024, 18% of the value of cars exported to the United States and 43% of auto parts were traded without using the Agreement. In the case of goods such as telephones, cell phones, computers and medical instruments, the MFN tariff is 0%, so exporting under the treaty does not confer a benefit in terms of tariff savings, while it would imply higher administrative costs and less flexibility to organize their supply chains."
                }
            ]
        },
        "id": "drn:archive.newsarticle.NAFTA00020250602el620002z",
        "type": "content"
    },
    {
        "meta": {
            "original_doc_id": "TOI0000020250603el630008l",
            "language": {
                "code": "en"
            },
            "source": {
                "code": "toi",
                "name": "The Times of India"
            }
        },
        "links": {
            "self": "https://api.dowjones.com/content/drn:archive.newsarticle.TOI0000020250603el630008l"
        },
        "attributes": {
            "snippet": {
                "content": [
                    {
                        "text": "India has formally requested consultations with the United States under the World Trade Organisation’s (WTO) Agreement on Safeguards, challenging recent American tariffs imposed on automobile parts.The move follows India’s earlier decision ..."
                    }
                ]
            },
            "copyright": {
                "text": "(c) 2025 The Times of India Group"
            },
            "content_type": "Article",
            "load_time": "2025-06-03T13:36:48.834Z",
            "modification_date": "2025-06-03",
            "publication_date": "2025-06-03",
            "load_date": "2025-06-03",
            "byline": {
                "text": "TOI Business Desk"
            },
            "headline": {
                "main": {
                    "text": "India invokes WTO mechanism to address US safeguard duties on auto components"
                }
            },
            "modification_time": "2025-06-03T13:35:19.000Z",
            "content": [
                {
                    "text": "India invokes WTO mechanism to address US safeguard duties on auto components India has formally requested consultations with the United States under the World Trade Organisation’s (WTO) Agreement on Safeguards, challenging recent American tariffs imposed on automobile parts.The move follows India’s earlier decision to reserve the right to impose retaliatory duties on select US goods in response to Washington’s tariffs on steel and aluminium.According to a communication sent by India to the WTO, the US on March 26, 2025, adopted a measure increasing tariffs by 25 per cent ad valorem on imports of passenger vehicles, light trucks, and certain auto components originating in or from India. These duties came into effect on May 3, 2025, and have been applied for an indefinite period, PTI reported.\"India considers that the measure, in its design and effect, constitutes a safeguard measure within the meaning of... GATT (General Agreement on Tariffs and Trade) 1994 and the Agreement on Safeguards, as it is intended to protect the US domestic industry from increased imports,\" the communication stated.India further noted that the United States failed to notify the WTO Committee on Safeguards about the decision to apply such measures, as required under the provisions of the Agreement on Safeguards (AoS).\"Accordingly, as an affected Member with significant export interest to the United States in the products concerned, India requests consultations with the United States,\" the communication added.India said it seeks to exchange views on the measure and its implications during the consultations.\"India looks forward to receiving a prompt reply to this request from the United States and to setting a mutually convenient date and venue for the... consultations,\" it said.India also reserved all its rights under the agreement establishing the WTO.In 2024, the United States imported auto parts worth USD 89 billion globally. Mexico was the top supplier at USD 36 billion, followed by China at USD 10.1 billion. India accounted for USD 2.2 billion of those imports. For Reprint Rights: timescontent.com"
                }
            ]
        },
        "id": "drn:archive.newsarticle.TOI0000020250603el630008l",
        "type": "content"
    },
    {
        "meta": {
            "original_doc_id": "KORTIM0020250603el630000i",
            "language": {
                "code": "en"
            },
            "source": {
                "code": "kortim",
                "name": "Korea Times"
            }
        },
        "links": {
            "self": "https://api.dowjones.com/content/drn:archive.newsarticle.KORTIM0020250603el630000i"
        },
        "attributes": {
            "snippet": {
                "content": [
                    {
                        "text": "The nation’s auto industry is trapped in a double whammy of drastic declining exports and a domestic consumption slump amid a prolonged leadership vacuum."
                    }
                ]
            },
            "copyright": {
                "text": "(c) 2025 Korea Times.  All rights reserved."
            },
            "content_type": "Article",
            "load_time": "2025-06-03T14:52:54.892Z",
            "modification_date": "2025-06-03",
            "publication_date": "2025-06-03",
            "load_date": "2025-06-03",
            "headline": {
                "main": {
                    "text": "Carmakers face double whammy of export fall, domestic slump amid leadership vacuum"
                }
            },
            "modification_time": "2025-06-03T14:51:07.000Z",
            "content": [
                {
                    "text": "Carmakers face double whammy of export fall, domestic slump amid leadership vacuum The nation’s auto industry is trapped in a double whammy of drastic declining exports and a domestic consumption slump amid a prolonged leadership vacuum. The export decline is attributed to U.S. President Donald Trump’s 25 percent auto tariff, which is expected to cause serious earnings damage to Hyundai Motor, Kia and General Motors (GM) Korea. The weakening domestic consumption is also cited as another major risk for the major automakers. Data from four major carmakers — Hyundai Motor, Kia, KG Mobility and GM Korea — reported a drop in domestic sales in May. Hyundai Motor’s vehicle sales decreased 5.2 percent last month from a year earlier, while those of Kia also dropped by 2.4 percent during the same period. KG Mobility and GM Korea suffered even bigger declines, with sales falling 11 percent and 39.8 percent, respectively. Renault Korea was the only top-five carmaker to report a sales growth last month. This was triggered by the economy’s continuous exposure to weak demand. Despite the economic slump, Korea has in recent months failed to implement any preemptive policy measures, after former President Yoon Suk Yeol was impeached over his martial law declaration. Industry officials argue the chaotic political environment has further aggravated the economic downturn. “The incumbent government seems to have lost its steam when it comes to taking timely actions for the economy following the removal of Yoon from office,” an auto industry official said. “The next government is advised to focus more on reviving the economy to help major firms, including carmakers, achieve sustainable growth.” To make matters worse, the carmakers are faced with growing management uncertainties due to the escalating tariff pressure from the United States. Seoul and Washington held several rounds of trade talks to narrow their differences on a series of trade agendas, but the two sides have yet to reach any meaningful outcome. Korea’s top priority in its ongoing trade negotiations with the U.S. is to abolish the auto tariff, as cars are one of the nation's top two export items, along with semiconductors. Automakers expect the inauguration of the next president to help reduce the lingering tariff-related uncertainties, even if it still requires more time for the economy to achieve any meaningful recovery. However, the absence of any vehicle-related policies from the two major presidential candidates' campaign pledges still remains a concern, according to industry officials. Both Democratic Party of Korea candidate Lee Jae-myung and People Power Party candidate Kim Moon-soo have focused on expanding the supply of electric vehicles (EVs), but officials said this is not enough, as the industry is now struggling to overcome the EV chasm before their mass adoption. “The government should pay more attention to resolving the tariff risk rather than focusing on sharing any unrealistic populist policy drives in support of future mobility,” another industry official said."
                }
            ]
        },
        "id": "drn:archive.newsarticle.KORTIM0020250603el630000i",
        "type": "content"
    }
]